[{"id":1599679980,"title":"How to Add Dark Mode to your Static Website","author":"No author given","date":"September 09, 2020","time":"20:33","thumbnail":"/image/dark-mode.png","content":"### Introduction\nDark mode is a trend that is fast becoming common among websites. It involves using low light to present content while still meeting the minimum colour contrast ratios for accessibility and usability. It helps to reduce eye strain, suitable for night time use and also saves battery power.\n\nIn this article, you will learn how to switch between a dark and light theme for your website, persist the selection and how to switch when the visitor has a preferred colour scheme.\n\n### Data-theme.\n\nThe data-theme attribute is part of the custom data-* attributes that you can use with HTML5 elements to store extra information. It is quite useful when you are working on hacks that don't need to be visible to the user. Here is an [MDN resource](https://developer.mozilla.org/en-US/docs/Learn/HTML/Howto/Use_data_attributes) detailing more about them. \n\nThe `data-theme` attribute would be used to house the value of our theme.\n\n### Local storage.\n\nYou will store the value of the theme selected by the visitor in the local storage since you don't want it to expire or get clear after you close the tab. This is a sample usage of the local storage API.\n\n```js\n// To store a value of an item.\nlocalStorage.setItem('theme', 'dark');\n\n// To get the value of an item\nconst theme = localStorage.getItem('theme');\n\n// To delete an item\nlocalStorage.removeItem('theme');\n\n// To clear everything stored in the localstorage\nlocalStorage.clear();\n```\n\n### Prefers color scheme\n\nThe `prefers-color-scheme` attribute is one of the [media features](https://developer.mozilla.org/en-US/docs/Web/CSS/Media_Queries/Using_media_queries#Media_features) of CSS that allows you to get the state or presence of some various characteristics from the device accessing that a particular webpage. [Check here](https://caniuse.com/?search=prefers-color-scheme) for the support.\n\n### CSS Variables\n\nCSS allows you to store variables adding `--` suffix to the variable name for example.\n\n```css\n* {\n  --primary: #eee; /* To set a variable. */\n  --secondary: #333;\n\t--display: none;\n}\n\nbody {\n  background-color: var(--primary); /* To access the variable */\n  color: var(--secondary);\n}\n\n.hero_text{\n\tdisplay: var(--display);\n}\n```\n\nHere is the JavaScript way of setting CSS variables.\n\n```js\ndocument.documentElement.style.setProperty('--primary', '#333');\n```\n\n### HTML\n\nThe HTML file will have some default text as our hero and SVGs that you use to tell the visitor what theme they are currently using.\n\n```html\n\n\t<h2 class=\"hero_main\">\n\t\tJust vibes.\n\t</h2>\n\t\n\t<p class=\"hero_sub\">\n\t\tSomething something next billion creators.\n\t</p>\n\t\n\t<label class=\"switch\">\n\t  <input type=\"checkbox\" id=\"theme_toggle\" />\n\t  <section class=\"theme_switch\">\n\t\n\t\t  <!-- moon svg -->\n\t\t\t<svg xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\"stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"moon\">\n\t\t\t  <path d=\"M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79z\"></path>\n\t\t  </svg>\n\t\t\n\t\t\t<!-- sun svg -->\n\t\t\t<svg xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" fill=\"none\"stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"sun\">\n\t\t\t\t<circle cx=\"12\" cy=\"12\" r=\"5\"></circle>\n\t\t\t\t<line x1=\"12\" y1=\"1\" x2=\"12\" y2=\"3\"></line>\n\t\t\t\t<line x1=\"12\" y1=\"21\" x2=\"12\" y2=\"23\"></line>\n\t\t\t\t<line x1=\"4.22\" y1=\"4.22\" x2=\"5.64\" y2=\"5.64\"></line>\n\t\t\t\t<line x1=\"18.36\" y1=\"18.36\" x2=\"19.78\" y2=\"19.78\"></line>\n\t\t\t\t<line x1=\"1\" y1=\"12\" x2=\"3\" y2=\"12\"></line>\n\t\t\t\t<line x1=\"21\" y1=\"12\" x2=\"23\" y2=\"12\"></line>\n\t\t\t\t<line x1=\"4.22\" y1=\"19.78\" x2=\"5.64\" y2=\"18.36\"></line>\n\t\t\t\t<line x1=\"18.36\" y1=\"5.64\" x2=\"19.78\" y2=\"4.22\"></line>\n\t\t\t</svg>\n\t\t</section>\n\t</label>\n```\n\nYou can also see that SVGS are wrapped inside a checkbox that way you can track the visitor's choice with the state of the checkbox and map that to each theme.\n\n### CSS\n\n```css\n*,\n*::before,\n*::after {\n  box-sizing: border-box;\n}\n\n* {\n  margin: 0;\n  padding: 0;\n  font: 62.5% 'Noto Sans', sans-serif;\n}\n\n:root {\n  --primary: #eee;\n  --secondary: #333;\n  --sun-display: none;\n  --moon-display: inline-block;\n}\n\n[data-theme='light'] {\n  --primary: #eee;\n  --secondary: #333;\n  --sun-display: none;\n  --moon-display: inline-block;\n}\n\n[data-theme='dark'] {\n  --primary: #333;\n  --secondary: #eee;\n  --sun-display: inline-block;\n  --moon-display: none;\n}\n\n@media (prefers-color-scheme: dark) {\n  :root {\n    --primary: #333;\n    --secondary: #eee;\n    --sun-display: inline-block;\n    --moon-display: none;\n  }\n}\n\n@media (prefers-color-scheme: light) {\n  :root {\n    --primary: #eee;\n    --secondary: #333;\n    --sun-display: none;\n    --moon-display: inline-block;\n  }\n}\n\nbody {\n  background-color: var(--primary);\n  color: var(--secondary);\n  min-height: 100vh;\n  display: flex;\n  align-items: center;\n  justify-content: center;\n  flex-direction: column;\n}\n\n.hero_main {\n  font-size: 4rem;\n  margin: 0.25em;\n}\n\n.hero_sub {\n  font-size: 2.5rem;\n  text-align: center;\n}\n\n.theme_switch {\n  cursor: pointer;\n}\n\n.moon {\n  display: var(--moon-display);\n  stroke: var(--secondary);\n}\n\n.sun {\n  display: var(--sun-display);\n  stroke: var(--secondary);\n}\n\n#theme_toggle {\n  display: none\n}\n```\n\n- The `[attribute=value]` selector is used to style the website based on the value specified.\n- There is a media query to check if the visitor prefers a dark or light color theme from the start and applies the appropriate style.\n- The display of the SVGs is also controlled by the theme.\n- The checkbox has its display set to none because the label tag still allows the checkbox to work as expected.\n\n### Choosing Colours\n\nWhile you are selecting colours to use for each theme, make sure that you are using colours that meet the minimum WCAG contrast ratio for accessibility. You can use [this tool](https://webaim.org/resources/contrastchecker/) for that purpose.\n\nSo far, the webpage can't switch between themes.\n\n### Switching between themes.\n\nFirst, you attach an event listener to the DOM to trigger just before the content is rendered so that you don't have a flash of the default theme then you need to attach an event listener to the checkbox on change so we can track the state of the checkbox.\n\n**Note:** We can still interact with the checkbox because `display: none` only removes an element from the document flow, it doesn't prevent it from existing and content inside the ```<label>``` tag can modify the checkbox\n\n \n\n```js\n<script>\n\twindow.addEventListener('DOMContentLoaded', () => {\n\t\tconst darkModeToggle = document.getElementById('theme_toggle');\n\n\t\tconst switchTheme = (e) => {\n\t\t\tif (e.target.checked) {\n\t\t\t\tdocument.documentElement.setAttribute('data-theme', 'dark');\n\t\t\t}\n\t\t\telse {\n\t\t\t\tdocument.documentElement.setAttribute('data-theme', 'light');\n\t\t\t}\n\t\t}\n\t\t\n\t\tdarkModeToggle.addEventListener('change', switchTheme, false);\n\t});\n</script>\n```\n\nNow, you control the active theme using the SVG and all that is left now is to be able to store the value of our data attribute and also detect the visitor's prefered colour scheme on the first load.\n\n```js\n\twindow.addEventListener('DOMContentLoaded', () => {\n\t\t...\n\n\t\tconst currentTheme = localStorage.getItem('theme') ? localStorage.getItem('theme') : null;\n\n\t\tif (currentTheme) {\n\t\t\tdocument.documentElement.setAttribute('data-theme', currentTheme);\n\n\t\t\tif (currentTheme === 'dark') {\n\t\t\t\tdarkModeToggle.checked = true;\n\t\t\t}\n\t\t}\n\n\t\tconst switchTheme = (e) => {\n\t\t....\n```\n\nThe currentTheme variable checks the localStorage to see there is a saved theme and returns null if there isn't. \n\nThe next step is to save the value of the theme when the state of the checkbox changes.\n\n```js\n\t...\n\t\tconst switchTheme = (e) => {\n\t\t\tif (e.target.checked) {\n\t\t\t\tdocument.documentElement.setAttribute('data-theme', 'dark');\n\t\t\t\tlocalStorage.setItem('theme', 'dark');\n\t\t\t}\n\t\t\telse {\n\t\t\t\tdocument.documentElement.setAttribute('data-theme', 'light');\n\t\t\t\tlocalStorage.setItem('theme', 'light');\n\t\t\t}\n\t\t}\n\t...\n```\n\nTo animate the transition between the themes, you can add this;\n\n```css\nbody {\n\t...\n\ttransition: background cubic-bezier(0.49, 0.11, 0.6, 1) 1.5s;\n}\n```\n\nAnd Voila! You have learnt how to switch between light and dark modes and persist the visitor's choice. Here is the link to [the repo](https://github.com/lilpolymath/darkmode) just in case.\n","slug":"how-to-add-dark-mode-to-your-static-websites","tags":["frontend"," static websites"]},{"id":1598287740,"title":"Personal Notes on useEffect","author":"No author given","date":"August 24, 2020","time":"17:49","thumbnail":"/image/react-hook.png","content":"\n# In the Beginning...\n\nThe useEffect hook takes two parameters. The first parameter is a function that gets runs when the useEffect is triggered by some change, the presence of the second parameter is conditional.\n\nYou call the hook by passing a function that you want to run when a particular change occurs and this is determined by the presence of the second parameter mentioned above.\n\n1. If the second parameter is empty e.g\n\n```js\nuseEffect(() => {\n  console.log('render');\n});\n```\n\nThe hook runs on every update (i.e. mount and re-render(s)) of parent functional component.\n\n2. If the second parameter is an empty array i.e.\n\n```js\nuseEffect(() => {\n  console.log('render');\n}, []);\n```\n\nThe hook on runs on the first mount solely.\n\n3. If the second parameter is an array that contains one or two values, the hook is called when any of these values changes.\n\n```js\nuseEffect(() => {\n  console.log('render');\n}, [name, email]);\n```\n\nIn this case, the arguments name and email are passed to the useEffect hook, therefore it watches to see if there are changes to the values - this is what is referred to as a subscription in the React docs.\n\nYou can now see that the presence of the second parameter determines whether the function declared is in the useEffect runs or not. Therefore the useEffect depends on it and because it takes an array of arguments it is referred to as an array of dependencies.\n\nTherefore the useEffect hook can be visualized as a function written this way.\n\n```js\nconst previousValues = [];\nlet renderedOnMount = false;\n\nfunction useEffect = (func, dependency) => {\n\n  if (dependency === undefined) {\n    func();\n    return;\n  }\n\n  else if (dependency.length === 0 && !renderedOnMount) {\n    let renderedOnMount = true;\n    func();\n    return;\n  }\n\n  else {\n    for (let index = 0; index < dependency.length; index++) {\n      if (previousValues[index] !== dependency[index]) {\n        previousValues = dependency;\n        func();\n        break;\n      }\n    }\n  }\n}\n```\n\n# and then came side effects\n\nSide effects can be referred to anything your function does that modifies the state of your application.\n\nWhen you are listening to a change in the state of a particular variable, we refer to that as a subscription and clearing that function is referred to as unsubscribing.\n\n```js\nimport React, { useState, useEffect } from 'react';\n\nexport default function App() {\n  const [windowWidth, setWindowWidth] = useState(window.innerWidth);\n  const resizeHandler = () => {\n    setWindowWidth(window.innerWidth);\n  };\n\n  useEffect(() => {\n    window.addEventListener('resize', resizeHandler);\n    return () => {\n      window.removeEventListener('resize', resizeHandler);\n    };\n  }, []);\n\n  return <div>{windowWidth}</div>;\n}\n```\n\nThe code above listens for a change in the size of the window width and updates the value of windowWidth.\n\nBecause we only need to add the eventListener once, and that is on render, we pass an empty array of dependencies and the useEffect adds the eventListener and the width of the window is updated accordingly. We only need to unsubscribe from this when we unmount the component.\n\nIf you want to get the best use of the useEffect hook, you need to know what variables are changing and tailor the hook towards that end.\n\n## Note\n\nA component re-render is different from when the component mount because on mount the component is just getting introduced to the VDOM and it renders for the first time, rendering means to update the DOM with a new set of instructions for creating the DOM.\n\nIn functional components, every state change triggers a re-rendering. Understanding this will help you to understand how the hooks affect each other.\n","slug":"personal-notes-on-use-effect","tags":["React"," React Hooks"]},{"id":1595272260,"title":"How to add tracked files to .gitignore","author":"No author given","date":"July 20, 2020","time":"20:11","thumbnail":"/image/github-mark.png","content":"\nAt one point or the other you might have committed some files or folders to your remote repo and after several commits you decide that you no longer want to track those files and you try to edit directly the .gitignore file but it doesn't work or sometimes I go as far as cutting the folder push a commit and paste the folder and add the folder to .gitignore then push as though it were a new one.\n\nThe reason for this issue is that the rules in your .gitignore only applies to untracked files therefore subsequent edits would apply to the following files and not the old ones.\n\nRun this \n```\ngit rm -r --cached directory-to-remove\ngit commit -m 'feat: remove \"directory-to-remove\" from remote repo'\ngit push origin master\n```\n\n```\ngit rm -r --cached directory-to-remove\n```\nThis command provides you with a preview of what is going to be deleted from your git cache.\n\n\nHowever you need to note that this doesn't remove the history of the file or folder from your git history and make it appear as though it never existed. To do that you can check out [BFG Repo Cleaner](!https://rtyley.github.io/bfg-repo-cleaner/) or you use `git filter-branch`. [Check out this guide](!https://docs.github.com/en/github/authenticating-to-github/removing-sensitive-data-from-a-repository#using-filter-branchs) on how to use it.\n\nHave fun!","slug":"how-to-add-tracked-files-to-gitignore","tags":["git","react","deployment"]},{"id":1595272260,"title":"About Startups and Ideas","author":"No author given","date":"July 20, 2020","time":"20:11","thumbnail":"/image/do-something.jpeg","content":"### Inception\nThis is a self rant. I tried as much as possible, albeit lazily, to make the presentation of my thoughts cohesive but let's see how well that worked out. If it turns out bad, blame Dance Monkey.\n\n### Getting Ready\nMy journey has a software developer began professional roughly 6 months ago thanks to my internship :D and I have gotten my fair share of getting offers to work with someone on one cool idea that is going to shake up the eCommerce or Social Media industry and well we know how it goes, you get offered equity and some small cash if you are lucky and sometimes you are advised to look at the long time benefits of \"pioneering\" an existing platform but here in Africa. \n\nRejecting these offers is all good until it is a family member or someone that you look up to in a way and you are paced in a difficult spot. You don't know how best to present the reasons why you are saying no and it looks like a betrayal of trust and you somehow have the light burden of thinking that you let someone down. This worsens if it someone you see every day or somehow can't ignore their presence but hang on.\n\n### The Canvas\nYou know what? It is fine to have ideas and paint the future bright and colourful but remember that you are the only one seeing that \"unique\" future and that you are not the only person that has this type of dream, there are thousands and I daresay millions with an idea that looks exactly like yours so what is going to make yours stand out and worth pursuing?\n\nThat is if you think I don't have my fair share of million dollars app or business idea and I want to sit in the corporate world hoping to work my ass off for some trillionaire employer. At my workplace, I have ideas almost every week and I am sure they miss me talking to them about such ideas.\n\n### The Palette\nSo what is going to make me drop my ideas for yours? Well, to know if you are serious, Money!!! Yup, it is a Money Driven Development. Or to be professional the funding. Something has to continually oil the gears. There has to be a sense of financial security from one end which I don't have at the moment. \n\nThat is what you are going to fall back on when it doesn't work out at some point. Nobody, at least that I know of, wants to work in a startup for 6 months and when it doesn't work out starts to complain he doesn't have one money or something, come off it my friend, you are talking in the rubbish.\n\n### Painting the Story\nAnother thing is that a good number of these founders think an Uber or YouTube clone can be ready in 3 months and they can be ready to launch by the 4th quarter and bam in a year or two you are rocking in the Maldives or some Caribbean resort, ahh dreams are nice and wonderful. \n\nApart from trying to convince people to work with you, how are you going to push your product and drive market adoption without needing to involve people at one point or the other. And if you are going to involve people, they are not going to work for free and would need some sort of compensation too.\n\n### The Finishing \nAnd yes, there are founders out there who didn't have a single dime on them to start their business but somehow they got people to work with them and now they are role models but what kept the people going is the concept of a shared vision. This is what gives the people around you the energy to keep going against all odds but let's be honest it takes someone that is in your circle to have this kind of synergy.\n\n### Subtle Details\nI believe it is possible to work in the corporate world and you get to live the life you have dreamed of. I believe that it is possible to get someone you don't know to work on a project for free but it takes work and a lot of convincing to do so. This is easier if there is a shared burden.\n\n### Exhibition\nSo yeah it is amazing to have ideas and all but you need money to get it running if you don't have it try to get it. Blessings.","slug":"about-startup-and-ideas","tags":["thoughts"," swe"]},{"id":1595099460,"title":"Using GitHub Pages to deploy your GitHub Project","author":"No author given","date":"July 18, 2020","time":"20:11","thumbnail":"/image/github-pages.jpeg","content":"\nGitHub Pages is a static site hosting service that takes HTML, CSS, and JavaScript files straight from a repository on GitHub, optionally runs the files through a build process, and publishes a website.\n\nIt was created by GitHub to allow developers to host their projects directly from a GitHub repository without having to pay for domain cost.\n\nYou can publish a website about to `https://<username>.github.io` and your project to `https://<username>.github.io/{your-project-name}`.\n\nThe purpose of this article is to guide you through publish your project with gh-pages whether it is a plain HTML, CSS & JavaScript project or it is built with React xD.\n\n\n### Plain HTML, CSS & JS\n1. If your website contains images make sure that they are not stored in a media folder as gh-pages doesn't parse relative imports well. You may have to upload your images to a service like Cloudinary.\n\n2. With that out of the way, navigate to your repository settings and locating the GitHub Pages section\n![image](https://i.imgur.com/5ZlMuH7.png)\n\n3. Select the master branch from the drop down menu and this triggers a refresh.\n![image](https://i.imgur.com/PDUMDMZ.png)\n\n4. When the page is done refreshing, navigate back to the GitHub Pages section and it should be active with the URL to the live project active.\n![image](https://i.imgur.com/T7EH5CC.png)\n\nNote that because of this setting each commit you make to the master branch updates the live project too.\n\n### React Project.\n1. Install gh-pages by running\n\n`npm install gh-pages` or `yarn add gh-pages`\n\nThis packages creates a `gh-pages` branch that would hold the build files for your project.\n\n2. In your package.json file\nadd the following line \n``` \n\"homepage\": \"https://<username>.github.io/<repo-name>\",\n```\n\nNote that the repo name can be anything not necessarily generic.\n\n3. Also update your scripts to contain \n```\n  \"scripts\": {\n    \"predeploy\": \"npm run build\",\n    \"deploy\": \"gh-pages -d build\",\n    ....\n   },\n```\n\nThe predeploy command generates a build that is ready to be published while the deploy command generates a build then deploys it\n4. When you are ready run \n```\nnpm run deploy\n```\n\nWait for it to finish deploying the site and check the URL you set as homepage in your package.json to view it.\n\nIf you get the error \n`git remote add origin https://github.com/lilpolymath/test-repo.git\ngit push -u origin master`\nrun \n```\nrm -rf node_modules/gh-pages/.cache\n```\nthat clears the cache for you and rerun the deploy command.","slug":"using-github-pages-to-deploy-your-github-project","tags":["react"," github"," static"]},{"id":1586469600,"title":"Bonds","author":"No author given","date":"April 09, 2020","time":"23:00","thumbnail":"/image/0-bonds.jpeg","content":"### Blueprint\nDisclaimer: This post contains a \"little\" bit of chemistry and physics to illustrate my point.\n\n\n### The Foundation\nA Bond refers to a thing used to tie something or to fasten things together. It is also a force or feeling that unites people; a shared emotion or interest. But I prefer the definition of a bond in chemistry, it is defined as a strong force of attraction holding atoms together in a molecule or crystal, resulting from the sharing or transfer of electrons.\n\n\n### Bricklaying and Electrical Fittings\nSo we can agree that a bond refers to something of common interest between at least two things or people. Basic Electrostatics teaches us that like charges repel and unlike charges attract and that is true everywhere atoms take the main stage, but when we talk about human beings, something quite the opposite usually happens.\nWe tend to associate with people that have the same ideas, thought patterns and future aspirations as us. While we tend to be more hostile with our naming, we refer to those that are unlike us as \"toxic\" or\" bad energy\" and we urge people to stay far away from them.\n\n### Plumbing and Painting\nI have never been a fan of having serious bonds with people, although, I tend to have one or two things that most people would like to have in their circle. I am what chemists call a loosely bound or free-electron because it can't be specifically tied to a position. I don't want to believe that I am the only one with this trait.\nSometimes, we move with a group for about two weeks and we decide to jump on another group for about a month and it becomes slightly difficult to pin us to a particular group and you are like, \"okay, what's up?\"\nBut the big picture, however, is that all these groups are subsets of the power set of groups with this person in the middle.\n\n\n### Window, Doors, and Roofing\nThese types of people tell you what they want you to know and which may include some of the things you want to hear. It is not like that that they don't care about the relationships but the issue is with the world and its numerous views and their doubts. They are fans of objectivity wanting to know what is right and what is wrong.\nWhat these people are attracted to in a group is not the people in themselves but the idea that seems to hold the group together. We all have different upbringings and extent of exposure, so it isn't hard to find at least one person in your immediate circle who is unsure about what they should believe in.\nIt isn't like that they don't want to stick to one ideology, but it becomes more difficult in a world that is becoming more and more subjective by the second. There are lots of grey areas in this world and when you begin to explore the ideas in the mainstream you wonder how people can express their views and stick to it.\n\n### Raising Fences\nThe truth is you won't find a group that believes in everything you do. No person is 100% confident or sure about what they believe in. We are humans and we have our doubts and some times, we may choose to ignore them but it doesn't mean they would go away like that.\nIt is important to note that in your search for truth, you may forget to detach your truth-seeking persona from your core self which has emotional makeup. This makeup I believe is there for a reason. Yes, it is possible to enjoy your company but remember that loads and burdens are easier to bear when there are extra hands.","slug":"bonds","tags":["relationship"]},{"id":1578082380,"title":"Expectations","author":"No author given","date":"January 03, 2020","time":"21:13","thumbnail":"/image/expectations.jpeg","content":"Expectation defined as a strong belief that something will happen or be the case. Sometimes our expectations can be realistic or not. As human beings, we all have expectations one way or the other, in our finances, our academics, our relationships, etc. It sums up why we do whatever we do. And what determines the frequency of our mood swings is how the graph of expectations fluctuates.\n\n### Expectations and Depression\n\nSome people can be affected seriously by this, they have lots of expectations and at some point in their lives everything was on target and at one point it turns around and rejection upon rejection and slowly they lower the bar of their expectations and pushes some of them to a point that they don’t expect anything from life again i.e they get depressed.\n\nOne of the things I learned last year is that having expectations is a gamble as is every other thing that we do and that **the bar of our expectations should vary with the number of things that you know**. The lower the bar, the lower the effect of your disappointments or Ls, the higher the bar, the higher the effect of your disappointment or joy and at times you are surprised at the turn out of something because it wasn’t what you expected.\n\n### Knowns and Unknowns\n\nYou see in life, there are two important concepts, the things you know — *knowns*, and the things you don’t know — *unknowns*. There are things that you know you know, we call them *the known knowns* and there are things you know you don’t know, *the known unknowns*. There are things that you don’t know you know, *the unknown knowns* and there are things you don’t know you don’t know *the unknown unknowns*.\n\nUnderstanding this is very crucial with the way you relate with anybody even yourself and this would help model your expectations. For example, when I apply for a job, there is always a job description this helps me check my bank of “knowns” and map them to the JD that way I can predict to a good percentage what would happen and how I would react to it. **This doesn’t prevent an L or something but it makes life easier to live.** You can cut down on your unrealistic expectations and focus more on the realistic ones.\n\nThis would help you make better choices in Life. This where I point out why it is important to keep track of your progress whether weekly or monthly, as it helps you to identify your unknown knowns and this will keep you from making “ I didn’t know I could do this” regrets. Put in enough time to learn your known unknowns too, take a course or two, ask for help from friends and your mentors. The journey is shorter by half if you walk with people.\n\nSo before you take another shot at expecting something, try and check your knowns and your unknowns and use this to determine if it is worth taking the shot or not.","slug":"expectations","tags":["Life"," Personal"]},{"id":1577999640,"title":"I was Naive","author":"No author given","date":"January 02, 2020","time":"22:14","thumbnail":"/image/twitter_post_-_1_egk6ok.png","content":"\n### Prelude\n\nThis year I put in my best so far, skilled up as a software developer, made some money, saved a good part of it too (yunno that thing about the future). I took care of myself, it was me first and people came later. I read my books on time and made good grades in my exams. I went on retreats, made sure my spiritual battery's backups didn't fail and met some great ministers that renewed my passion for Christ. I met with my covenant friends and made great connections. It was a Year of All-around results. Yeah, all that didn't happen. Never did.\n\n### January\n\nI was on a retreat throughout the whole month, charging my spirit man vigorously 24/7 seriously and intentional with my growth listening only to the Davidic Minstrels and asking serious questions from my senior friends. I was also working for them building their website, I have so engrossed in it that my parents had little-ish with me and said some things that because my spirit man was very open stuck to my subconscious - I became money-driven. I was just charging, bursting into Encounters and all that. I am a nice writer you see and I was writing some posts weekly under the name \"Tales from Cave Adullam\".. Ha Blessed times. I loved the supernatural.\n\n### February\n\nThis month I believe was the turning point of everything, the beginning of the change. 2018, I followed him and I was like how could we be going through similar paths and I was eager to meet him late 2018, I sent a text I am not sure he saw. But he reached out to me and my friends to help with an app and I happily obliged, I felt like this could be finally where everything would change for better. Young Zuck lol. I was naive.\n\n### March - April\n\nSchool had resumed, little time before preparations for exams and we couldn't start the work yet kept shifting for some good reasons but my guys pulled out because we couldn't work on the project anymore, money issues. This project is what made me learn JS for real and start to React + React Native and anything you know me for today. I did a lot of research during this period man.. I sought to consolidate for my technical debt in a short while but I was met with burnouts. It was during this time I worked 100hrs in a week. And smart guy, my grades took care of themselves, I mean I answered questions from my sleep in class a few times and went back to it. Yes, you can say I shouldn't have taken the opportunity then but it made me who I am today, the bad and the good part all started here. My parents started getting worried about remote work. Me I didn't care sha it was part of the sacrifices I had to make.. stupid me. During this time, I was using my former laptop(my first wife), 3GB of RAM and I was running VSCode and Chrome, trust me you don't want this while doing React Native. Had to wait for like 5 mins before `expo start` would run. Funny enough, the battery was bad, barely lasted an hour and I worked 100hours, yeah NEPA did me dirty. Around this time I stopped writing tho, I still receive the titles of what I am supposed to write.\n\n### May - June\n\n#### As A Dev\n\nThe Pressure to deliver increased, I am thrown wide open into the river of beautiful UIs and deliberating which stack to implement reading engineering blogs from various tech companies with features that the app should have. I remember Saturday, May 18 when I added Biometric functionality and sorted out the logic for authentication. Mostly what I did here was to document what I need to be added, what to churn out etc. I was the entire engineering team and at times I would be doesn't this man know I am a student ni. I did learn a couple of things but some the hard way. Don't cast stones, I made promises that I thought I could keep hence the pressure but he wasn't a tech person so I guess he didn't understand me. Yeah, I applied to Andela and almost got into SwipeMax as a Junior Dev but school and parents, you know the rest.\n\n#### Finances\n\nI was a reluctant member of the \"we go buy Benz\" and Crypto was looking like the way and took my 35k + my allowance + departmental and faculty dues + some cash at hand made series of transactions alongside Victor and I lost everything, sort of. I went hungry for some days but thank God. That was what crippled my finances, I had debts to pay and I was no longer the Genie that fulfilled people's wishes.\n\n### July\n\nI parted ways with my employer in a funny way. You see that was when I started ghosting people not getting online deliberately not picking calls for weeks etc but we thank God. I am still struggling with that habit but I will do better, I promise. I couldn't move up with life because he was everywhere and I was like what if he told this person or that. I was just traumatized even till now if he checks my status I shudder, yeah I can't bring myself to delete his number not yet. You see, I had people that could have taken care of me but I was busying taking care of others that I didn't realize how deeply hurt I was. I stopped posting a lot on WhatsApp then. UI Prays was during this time and I went there solely to feed my desires with the power available this thing must have a balance but that one is for another time. During this time, I applied to GitHub, Auth) and Ingressive as a Campus Ambassador but yeah I was rejected, all my friends got in as Ingressive Campus Ambassadors. Yipee, a win for the guys is a win for me too.\n\n### August\n\nMy Birth Month. Yeah, it didn't go as planned but I went for a retreat and all that because my spiritual life was on a low mad low but that still didn't stop all these small boy manifestations during meetings. I know to some extent how to manipulate spiritual laws lol and like I mentioned at the start of this year I asked serious questions what I asked and found answers to where what people would ask me throughout the year and they knew never something was wrong and that worries me. Nevertheless, this began the series of rejections that flooded till late November. I was near breakdown, questioned my skills and aggressively pushed to compensate them. I got a new laptop this month and I was damn happy, do you know what it meant?? I was just coding and trying to fill up the gaps in my \"years of experience\". Yeah, I resent an application to Ingressive, moved to the next stage, made the video but I never sent it.\n\n### September\n\nThe recent events began to mess with my head and I couldn't concentrate anymore. a friend of mine still persuades me to work on it but anyways. I started to use Twitter made new friends Richard, Michael Ikechi, Jude, Raymond, Shalvah, Kofo, Korede, etc. My tweet for an internship made rounds but that still didn't stop rejections. I was also pressured subconsciously by my friends, everyone seemed to make it one way or the other and I was left behind and yes they whined me and I am like you don't understand. I was skipping classes, missing out on things and fun moments and you have to be doing something tangible right Nah I was trying to suppress mental and the physical burnout I had in previous months. I was also trying to fit in into cliques sort of but it didn't work out well. Remember the dues, Michael Ikechi sent me the money to pay for it. That is my first money gift and I will be forever grateful.\n\n### October\n\nA Nice month I must say, two companies decided to shine their lights on my resume, thank God. Oando called me for an interview twice but I chopped L at the end. I knew from the start though so it didn't surprise me. I remember when I came to Lagos and got lost, yeah don't blame me, my phone was dead throughout. I was given a shot at MKobo been there for two months and I must say it has been a nice stay so far. My first semester 300L exams and I crash read again. They said results are out but I haven't checked it yet. I was preparing to leave UI for 6 months and improve spiritually, physically, financially and all that. I tried to break my Twitter \"addiction\", locked my account and changed the password and sent it to me in 2 weeks then after exams but I recovered the account when I received a Twitter DM from a client - email notifications. The deal didn't work out at the end.\n\n### November\n\nAh! IT begins said all my goodbyes to everyone and all of that and set my foot on a journey to a different place. I don't know what exactly happened this month but loneliness hit me hard. I realized I was just thriving because I had people around me, I couldn't but smile because people were around me and they took away my regrets and robbed me of time. I wanted to go for a mental checkup then because I wasn't sure anymore. I noticed that I picked up some funny traits on Twitter so I had to detoxify my mentality, reduce my engagements and all that and it did some work. I arranged to meet with Richard my online React Native Mentor and I got lost, again, yeah my phone was dead so no maps. I also started a Mini Frontend Bootcamp with DSC UI members, I realized that I learn better when I carry people along, I will do my best to remain committed to it. I sent a letter to future me delivers by April, can't wait to see what I wrote.\n\n### December\n\nFriends pulled me out of my loneliness. I fell in love with UI/UX here because it was hindering my productivity. I like to be creative and claim ownership to everything because I am a \"Do it from scratch\" guy but I had to fight that mentality and I have minor breakthroughs already. I met with Michael, alongside Jude and Raymond. But I am glad for one thing, everyone around had a great year.\n\n### Endnote\n\nWhile all these happening, I still couldn't but change people's lives, I was shocked when the texts were coming in, I may be a sly and/or an annoying person, looking as though I have answers to all your questions but I can't resist helping people in need, whether financially, spiritually, career-wise, etc. The passion to find solutions to people's problem keeps me awake.\n\n### Shout out\n\nMumsy Marvellous, Popsy Emmanuel, El Blessing, Mumsy Seun, Pst Israel, Pst Lawrence, Proph. John De Liberty, Apst. Mike Orokpo, Peace, Glory, Lola, Daniel, Seun, Deolu, Deborah, Adura, Kayode, Michael Ikechi, Michael Mekuleyi, Josiah, MFMCF UI, DSC UI, Nerv, \"Because, why not?\", and everyone I know, thank you all for a great year.\n\nI bet you didn't know all these happened? But at least you have the answers to some questions already.","slug":"2019-i-was-naive","tags":["life"]}]